# HP_AutoAttachLoads

## Description
Using the given position handle, attaches all loads, that can be calculated as a part of the system and loads attached to the geometry in the position.

```pascal
PROCEDURE HP_AutoAttachLoads(positionHandle : HANDLE);
```

```python
def vs.HP_AutoAttachLoads(positionHandle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|positionHandle|HANDLE|   |

## Version
Availability: from Vectorworks 2019

## Category
* Truss Analysis